/****************************************************************************************
 * 016 - Добавление элементов
 * --------------------------------------------------------------------------------------
 * PhpStorm 2023.1
 * jQuery 3.7
 * HTML, CSS, JavaScript
 * --------------------------------------------------------------------------------------
 * Изучение библиотек jQuery
 * Gosha Dudar (2015)
 * https://www.youtube.com/watch?v=458mWXnWSmA&list=PL0lO_mIqDDFXQk_TTlSO7y7J1l5e-RMgi
 *
 ****************************************************************************************
 * Writing & Modification by sgiman @ 2023-09
 */

$("div").append("<span> (Простой текст) </span>")           // добавить во все "DIV"
$("img").appendTo($("#div_2"))                              // перенести img после div c id="#div_1"
$("a").wrap("<p style='background:navajowhite;'></p>>")     // обернуть в тег "p" c новым стилем

