/****************************************************************************************
 * 008 - Отбор элементов
 * --------------------------------------------------------------------------------------
 * PhpStorm 2023.1
 * jQuery 3.7
 * HTML, CSS, JavaScript
 * --------------------------------------------------------------------------------------
 * Изучение библиотек jQuery
 * Gosha Dudar (2015)
 * https://www.youtube.com/watch?v=458mWXnWSmA&list=PL0lO_mIqDDFXQk_TTlSO7y7J1l5e-RMgi
 *
 ****************************************************************************************
 * Writing & Modification by sgiman @ 2023-09
 */

//let link = $("a")                 // выбрать все ссылки
let link = $("#menu li a:first")    // выбрать первую ссылку из меню "id=#menu"
alert(link.html())                  // вывести содержимое

link = $("#menu li a:eq(2)")        // выбрать 3-ю ссылку из меню "id=#menu"
alert(link.html())