/****************************************************************************************
 * 015 - Функция clone()
 * --------------------------------------------------------------------------------------
 * PhpStorm 2023.1
 * jQuery 3.7
 * HTML, CSS, JavaScript
 * --------------------------------------------------------------------------------------
 * Изучение библиотек jQuery
 * Gosha Dudar (2015)
 * https://www.youtube.com/watch?v=458mWXnWSmA&list=PL0lO_mIqDDFXQk_TTlSO7y7J1l5e-RMgi
 *
 ****************************************************************************************
 * Writing & Modification by sgiman @ 2023-09
 */

let block = $("#div").clone()       // клонировать

block.html("<p>Новый абзац</p>")    // новое содержимое (HTML)
block.css("font-size", "48px")      // стиль (CSS)
block.css("width", "200px")

$("body").append(block)             // добавить в конец "BODY"
//$("#div").append(block)
